In [8]:
import pandas as pd
pd.set_option('display.max_columns',10)
print("ORIGINAL DATA:\n")
df=pd.read_excel("dcap.xlsx")
print(df)

ORIGINAL DATA:

    S.No  roll      name   eng   tam  math  science  social  total
0      1   100       ram  60.0   4.0   0.0      6.0    96.0    166
1      2   101       som  77.0   6.0   4.0     78.0    56.0    221
2      3   102      sita  56.0  78.0   6.0     96.0    77.0    313
3      4   103      gita   4.0  96.0  78.0     56.0    34.0    268
4      5   104     meera   6.0  56.0  96.0     77.0    96.0    331
5      6   105     priya  78.0  77.0  56.0     34.0    56.0    301
6      7   106    ganesh  96.0  34.0  77.0     56.0    77.0    340
7      8   107     fahim  56.0   NaN  34.0     34.0    34.0    158
8      9   108    joshua  77.0  78.0  60.0     60.0    96.0    371
9     10   109     johan  34.0  67.0  78.0     78.0    56.0    313
10    11   110  kamalesh  56.0  45.0  77.0     77.0    77.0    332
11    12   111      mani  78.0   4.0   4.0      4.0    34.0    124
12    13   112     kumar  67.0  33.0   6.0     34.0    96.0    236
13    14   113    suresh   NaN   NaN   NaN      NaN     NaN      0
14    15   114    ramesh  45.0  99.0  96.0     78.0    77.0    395
15    16   115    harish   4.0  76.0  56.0     77.0    78.0    291
16    17   116     gopal  33.0  45.0  77.0      4.0    96.0    255
17    18   117    rampal  68.0   4.0  34.0      6.0    56.0    168
18    19   118      paul  99.0  33.0  33.0     76.0    77.0    318
19    20   119   kishore  76.0  68.0  68.0     45.0    77.0    334

In [9]:
#stripping name and rewriting it in the old file(only name will be present)
f=df['name'].str.strip()
f.to_excel("dcap.xlsx")
print(f)

0          ram
1          som
2         sita
3         gita
4        meera
5        priya
6       ganesh
7        fahim
8       joshua
9        johan
10    kamalesh
11        mani
12       kumar
13      suresh
14      ramesh
15      harish
16       gopal
17      rampal
18        paul
19     kishore
Name: name, dtype: object

In [12]:
#stripping name from one file and pasting it in a new blank file
f=df['name'].str.strip()
f.to_excel("/Users/student/Desktop/KANISHKAR/blank.xlsx")
print(f)

0          ram
1          som
2         sita
3         gita
4        meera
5        priya
6       ganesh
7        fahim
8       joshua
9        johan
10    kamalesh
11        mani
12       kumar
13      suresh
14      ramesh
15      harish
16       gopal
17      rampal
18        paul
19     kishore
Name: name, dtype: object

In [15]:
#filling nan values with backfill
print("REPLACE VALUE:")
k=df.fillna(method='pad')
print(k)
print("UPDATED LIST:")
k.to_excel("dcap1.xlsx")
print(k)

REPLACE VALUE:
    S.No  roll      name   eng   tam  math  science  social  total
0      1   100       ram  60.0   4.0   0.0      6.0    96.0    166
1      2   101       som  77.0   6.0   4.0     78.0    56.0    221
2      3   102      sita  56.0  78.0   6.0     96.0    77.0    313
3      4   103      gita   4.0  96.0  78.0     56.0    34.0    268
4      5   104     meera   6.0  56.0  96.0     77.0    96.0    331
5      6   105     priya  78.0  77.0  56.0     34.0    56.0    301
6      7   106    ganesh  96.0  34.0  77.0     56.0    77.0    340
7      8   107     fahim  56.0  34.0  34.0     34.0    34.0    158
8      9   108    joshua  77.0  78.0  60.0     60.0    96.0    371
9     10   109     johan  34.0  67.0  78.0     78.0    56.0    313
10    11   110  kamalesh  56.0  45.0  77.0     77.0    77.0    332
11    12   111      mani  78.0   4.0   4.0      4.0    34.0    124
12    13   112     kumar  67.0  33.0   6.0     34.0    96.0    236
13    14   113    suresh  67.0  33.0   6.0     34.0    96.0      0
14    15   114    ramesh  45.0  99.0  96.0     78.0    77.0    395
15    16   115    harish   4.0  76.0  56.0     77.0    78.0    291
16    17   116     gopal  33.0  45.0  77.0      4.0    96.0    255
17    18   117    rampal  68.0   4.0  34.0      6.0    56.0    168
18    19   118      paul  99.0  33.0  33.0     76.0    77.0    318
19    20   119   kishore  76.0  68.0  68.0     45.0    77.0    334
UPDATED LIST:
    S.No  roll      name   eng   tam  math  science  social  total
0      1   100       ram  60.0   4.0   0.0      6.0    96.0    166
1      2   101       som  77.0   6.0   4.0     78.0    56.0    221
2      3   102      sita  56.0  78.0   6.0     96.0    77.0    313
3      4   103      gita   4.0  96.0  78.0     56.0    34.0    268
4      5   104     meera   6.0  56.0  96.0     77.0    96.0    331
5      6   105     priya  78.0  77.0  56.0     34.0    56.0    301
6      7   106    ganesh  96.0  34.0  77.0     56.0    77.0    340
7      8   107     fahim  56.0  34.0  34.0     34.0    34.0    158
8      9   108    joshua  77.0  78.0  60.0     60.0    96.0    371
9     10   109     johan  34.0  67.0  78.0     78.0    56.0    313
10    11   110  kamalesh  56.0  45.0  77.0     77.0    77.0    332
11    12   111      mani  78.0   4.0   4.0      4.0    34.0    124
12    13   112     kumar  67.0  33.0   6.0     34.0    96.0    236
13    14   113    suresh  67.0  33.0   6.0     34.0    96.0      0
14    15   114    ramesh  45.0  99.0  96.0     78.0    77.0    395
15    16   115    harish   4.0  76.0  56.0     77.0    78.0    291
16    17   116     gopal  33.0  45.0  77.0      4.0    96.0    255
17    18   117    rampal  68.0   4.0  34.0      6.0    56.0    168
18    19   118      paul  99.0  33.0  33.0     76.0    77.0    318
19    20   119   kishore  76.0  68.0  68.0     45.0    77.0    334

In [16]:
print("DROP ONE PARTICULAR COLUMN AND ITS VALUES:")
k.drop(['social'],axis=1,inplace=True)
print(k)
print("UPDATED LIST")
#to update k.to_excel("filename.xlsx")

DROP ONE PARTICULAR COLUMN AND ITS VALUES:
    S.No  roll      name   eng   tam  math  science  total
0      1   100       ram  60.0   4.0   0.0      6.0    166
1      2   101       som  77.0   6.0   4.0     78.0    221
2      3   102      sita  56.0  78.0   6.0     96.0    313
3      4   103      gita   4.0  96.0  78.0     56.0    268
4      5   104     meera   6.0  56.0  96.0     77.0    331
5      6   105     priya  78.0  77.0  56.0     34.0    301
6      7   106    ganesh  96.0  34.0  77.0     56.0    340
7      8   107     fahim  56.0  34.0  34.0     34.0    158
8      9   108    joshua  77.0  78.0  60.0     60.0    371
9     10   109     johan  34.0  67.0  78.0     78.0    313
10    11   110  kamalesh  56.0  45.0  77.0     77.0    332
11    12   111      mani  78.0   4.0   4.0      4.0    124
12    13   112     kumar  67.0  33.0   6.0     34.0    236
13    14   113    suresh  67.0  33.0   6.0     34.0      0
14    15   114    ramesh  45.0  99.0  96.0     78.0    395
15    16   115    harish   4.0  76.0  56.0     77.0    291
16    17   116     gopal  33.0  45.0  77.0      4.0    255
17    18   117    rampal  68.0   4.0  34.0      6.0    168
18    19   118      paul  99.0  33.0  33.0     76.0    318
19    20   119   kishore  76.0  68.0  68.0     45.0    334
UPDATED LIST

In [20]:
#DROPPING ROWS WITH NaN in any of ITS CELLS
print("DROP NaN ROWS:")
df=pd.read_excel("org.xlsx")
print("ORIGINAL FILE")
print(df)
x=df.dropna()
print("DROPPED DATAFRAME:")
print(x)
#updating in spreadsheet
#print("UPDATED LIST:")
#x.to_excel("blank.xlsx")

DROP NaN ROWS:
ORIGINAL FILE
    S.No  roll      name   eng   tam  math  science  social  total
0      1   100       ram  60.0   4.0   0.0      6.0    96.0    166
1      2   101       som  77.0   6.0   4.0     78.0    56.0    221
2      3   102      sita  56.0  78.0   6.0     96.0    77.0    313
3      4   103      gita   4.0  96.0  78.0     56.0    34.0    268
4      5   104     meera   6.0  56.0  96.0     77.0    96.0    331
5      6   105     priya  78.0  77.0  56.0     34.0    56.0    301
6      7   106    ganesh  96.0  34.0  77.0     56.0    77.0    340
7      8   107     fahim  56.0   NaN  34.0     34.0    34.0    158
8      9   108    joshua  77.0  78.0  60.0     60.0    96.0    371
9     10   109     johan  34.0  67.0  78.0     78.0    56.0    313
10    11   110  kamalesh  56.0  45.0  77.0     77.0    77.0    332
11    12   111      mani  78.0   4.0   4.0      4.0    34.0    124
12    13   112     kumar  67.0  33.0   6.0     34.0    96.0    236
13    14   113    suresh   NaN   NaN   NaN      NaN     NaN      0
14    15   114    ramesh  45.0  99.0  96.0     78.0    77.0    395
15    16   115    harish   4.0  76.0  56.0     77.0    78.0    291
16    17   116     gopal  33.0  45.0  77.0      4.0    96.0    255
17    18   117    rampal  68.0   4.0  34.0      6.0    56.0    168
18    19   118      paul  99.0  33.0  33.0     76.0    77.0    318
19    20   119   kishore  76.0  68.0  68.0     45.0    77.0    334
DROPPED DATAFRAME:
    S.No  roll      name   eng   tam  math  science  social  total
0      1   100       ram  60.0   4.0   0.0      6.0    96.0    166
1      2   101       som  77.0   6.0   4.0     78.0    56.0    221
2      3   102      sita  56.0  78.0   6.0     96.0    77.0    313
3      4   103      gita   4.0  96.0  78.0     56.0    34.0    268
4      5   104     meera   6.0  56.0  96.0     77.0    96.0    331
5      6   105     priya  78.0  77.0  56.0     34.0    56.0    301
6      7   106    ganesh  96.0  34.0  77.0     56.0    77.0    340
8      9   108    joshua  77.0  78.0  60.0     60.0    96.0    371
9     10   109     johan  34.0  67.0  78.0     78.0    56.0    313
10    11   110  kamalesh  56.0  45.0  77.0     77.0    77.0    332
11    12   111      mani  78.0   4.0   4.0      4.0    34.0    124
12    13   112     kumar  67.0  33.0   6.0     34.0    96.0    236
14    15   114    ramesh  45.0  99.0  96.0     78.0    77.0    395
15    16   115    harish   4.0  76.0  56.0     77.0    78.0    291
16    17   116     gopal  33.0  45.0  77.0      4.0    96.0    255
17    18   117    rampal  68.0   4.0  34.0      6.0    56.0    168
18    19   118      paul  99.0  33.0  33.0     76.0    77.0    318
19    20   119   kishore  76.0  68.0  68.0     45.0    77.0    334